nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1152xxxxx
package_id: MIMXRT1152XHM8B
mcu_data: ksdk2_0
processor_version: 0.0.0
board: FRDM-MIMXRT1150
pin_labels:
- {pin_num: AD18, pin_signal: PMIC_ON_REQ, label: PMIC_ON_REQ, identifier: SW6}
- {pin_num: N3, pin_signal: GPIO_EMC_B1_36, label: GPIO_EMC_B1_36, identifier: GREEN_LED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitPWM();
    BOARD_InitADC();
    BOARD_InitCMP();
    BOARD_InitENC();
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: T18, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25}
  - {pin_num: T19, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUARTPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: V19, peripheral: LPUART8, signal: RTS_B, pin_signal: GPIO_AD_05}
  - {pin_num: Y19, peripheral: LPUART8, signal: TXD, pin_signal: GPIO_AD_02}
  - {pin_num: W25, peripheral: LPUART8, signal: RXD, pin_signal: GPIO_AD_03}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUARTPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUARTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_02_LPUART8_TXD,          /* GPIO_AD_02 is configured as LPUART8_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_03_LPUART8_RXD,          /* GPIO_AD_03 is configured as LPUART8_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_05_LPUART8_RTS_B,        /* GPIO_AD_05 is configured as LPUART8_RTS_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: G1, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_B1_00}
  - {pin_num: H2, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_B1_01}
  - {pin_num: K7, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_B1_02}
  - {pin_num: E3, peripheral: PWM4, signal: 'B, 1', pin_signal: GPIO_EMC_B1_03}
  - {pin_num: L3, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_B1_04}
  - {pin_num: F2, peripheral: PWM4, signal: 'B, 2', pin_signal: GPIO_EMC_B1_05}
  - {peripheral: PWM4, signal: 'FAULT, 0', pin_signal: ACMP2_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_FLEXPWM4_PWM0_A,  /* GPIO_EMC_B1_00 is configured as FLEXPWM4_PWM0_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_FLEXPWM4_PWM0_B,  /* GPIO_EMC_B1_01 is configured as FLEXPWM4_PWM0_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_FLEXPWM4_PWM1_A,  /* GPIO_EMC_B1_02 is configured as FLEXPWM4_PWM1_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_03_FLEXPWM4_PWM1_B,  /* GPIO_EMC_B1_03 is configured as FLEXPWM4_PWM1_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_FLEXPWM4_PWM2_A,  /* GPIO_EMC_B1_04 is configured as FLEXPWM4_PWM2_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_05_FLEXPWM4_PWM2_B,  /* GPIO_EMC_B1_05 is configured as FLEXPWM4_PWM2_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputAcmp2Out, kXBARA1_OutputFlexpwm4Fault0); /* ACMP2_OUT output assigned to XBARA1_IN43 input is connected to XBARA1_OUT91 output assigned to FLEXPWM4_FAULT0 */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: T24, peripheral: LPADC1, signal: 'A, 1_3', pin_signal: GPIO_AD_12}
  - {pin_num: T24, peripheral: LPADC2, signal: 'A, 2_3', pin_signal: GPIO_AD_12, identifier: ''}
  - {pin_num: U25, peripheral: LPADC1, signal: 'B, 1_3', pin_signal: GPIO_AD_13}
  - {pin_num: U25, peripheral: LPADC2, signal: 'B, 2_3', pin_signal: GPIO_AD_13, identifier: ''}
  - {pin_num: Y24, peripheral: LPADC1, signal: 'A, 1_0', pin_signal: GPIO_AD_06}
  - {pin_num: W23, peripheral: LPADC1, signal: 'B, 1_0', pin_signal: GPIO_AD_07}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_06_GPIO_MUX3_IO05,       /* GPIO_AD_06 is configured as GPIO_MUX3_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_07_GPIO_MUX3_IO06,       /* GPIO_AD_07 is configured as GPIO_MUX3_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_12_GPIO_MUX3_IO11,       /* GPIO_AD_12 is configured as GPIO_MUX3_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_13_GPIO_MUX3_IO12,       /* GPIO_AD_13 is configured as GPIO_MUX3_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCMP:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: R23, peripheral: CMP2, signal: 'IN, 4', pin_signal: GPIO_AD_27}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCMP, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCMP(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_27_GPIO_MUX3_IO26,       /* GPIO_AD_27 is configured as GPIO_MUX3_IO26 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: B4, peripheral: ENC1, signal: 'PHASE, A', pin_signal: GPIO_EMC_B1_12}
  - {pin_num: C1, peripheral: ENC1, signal: 'PHASE, B', pin_signal: GPIO_EMC_B1_13}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_XBAR1_INOUT04,    /* GPIO_EMC_B1_12 is configured as XBAR1_INOUT04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_XBAR1_INOUT05,    /* GPIO_EMC_B1_13 is configured as XBAR1_INOUT05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR20 = ((IOMUXC_GPR->GPR20 &
    (~(IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4_MASK | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4(0x00U) /* IOMUXC XBAR_INOUT4 function direction select: 0x00U */
      | IOMUXC_GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5(0x00U) /* IOMUXC XBAR_INOUT5 function direction select: 0x00U */
    );
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout04, kXBARA1_OutputDec1Phasea); /* IOMUX_XBAR_INOUT04 output assigned to XBARA1_IN4 input is connected to XBARA1_OUT108 output assigned to DEC1_PHASEA */
  XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputIomuxXbarInout05, kXBARA1_OutputDec1Phaseb); /* IOMUX_XBAR_INOUT05 output assigned to XBARA1_IN5 input is connected to XBARA1_OUT109 output assigned to DEC1_PHASEB */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: AD18, peripheral: GPIO13, signal: 'gpio_io, 01', pin_signal: PMIC_ON_REQ, direction: INPUT}
  - {pin_num: N1, peripheral: GPIO7, signal: 'gpio_io, 21', pin_signal: GPIO_EMC_B1_21, direction: OUTPUT}
  - {pin_num: N3, peripheral: GPIO8, signal: 'gpio_io, 04', pin_signal: GPIO_EMC_B1_36, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  /* GPIO configuration of FLEXIO_21 on GPIO_EMC_B1_21 (pin N1) */
  gpio_pin_config_t FLEXIO_21_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_21 (pin N1) */
  GPIO_PinInit(GPIO7, 21U, &FLEXIO_21_config);

  /* GPIO configuration of GREEN_LED on GPIO_EMC_B1_36 (pin N3) */
  gpio_pin_config_t GREEN_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_36 (pin N3) */
  GPIO_PinInit(GPIO8, 4U, &GREEN_LED_config);

  /* GPIO configuration of SW6 on PMIC_ON_REQ_DIG (pin AD18) */
  gpio_pin_config_t SW6_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on PMIC_ON_REQ_DIG (pin AD18) */
  GPIO_PinInit(GPIO13, 1U, &SW6_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_21_GPIO7_IO21,       /* GPIO_EMC_B1_21 is configured as GPIO7_IO21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_36_GPIO8_IO04,       /* GPIO_EMC_B1_36 is configured as GPIO8_IO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_PMIC_ON_REQ_DIG_GPIO13_IO01,     /* PMIC_ON_REQ_DIG is configured as GPIO13_IO01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
